In [1]:
from sqlalchemy import create_engine

engine = create_engine(
    "db2+ibm_db://daniel:db2dani@52.211.123.34:25010/IEMASTER"
)

In [3]:
import pandas as pd
from sqlalchemy import inspect

# Option 1: Using SQLAlchemy Inspector (Database Agnostic)
# This is the recommended way to explore database structure with SQLAlchemy
inspector = inspect(engine)

# List all schemas
schemas = inspector.get_schema_names()
print(f"Found {len(schemas)} schemas. First 5: {schemas[:5]}")

# List tables in the default schema
# You can pass a schema name to get_table_names(schema='SOME_SCHEMA')
tables = inspector.get_table_names()
print(f"Tables in default schema: {tables}")

# Option 2: Querying DB2 System Catalog directly (DB2 Specific)
# SYSCAT.TABLES contains metadata about tables
# We filter out system schemas (starting with SYS) to see user tables
catalog_query = """
SELECT TABSCHEMA, TABNAME, TYPE, CARD as ROW_COUNT
FROM SYSCAT.TABLES
WHERE TABSCHEMA NOT LIKE 'SYS%'
FETCH FIRST 10 ROWS ONLY
"""

pd.read_sql(catalog_query, engine)

Found 5 schemas. First 5: ['db2admin', 'ieplane', 'localadmin', 'nullid', 'sqlj']
Tables in default schema: []

  tabschema     tabname TYPE  row_count
0  IEPLANE    COUNTRIES    T        196
1  IEPLANE   DEPARTMENT    T         22
2  IEPLANE     EMPLOYEE    T       1598
3  IEPLANE    AIRPLANES    T        120
4  IEPLANE     AIRPORTS    T         30
5  IEPLANE       ROUTES    T         59
6  IEPLANE      FLIGHTS    T     297471
7  IEPLANE   PASSENGERS    T      50000
8  IEPLANE      TICKETS    T   35383337

In [8]:
# List of tables identified in the IEPLANE schema
tables_to_check = [
    "COUNTRIES", 
    "DEPARTMENT", 
    "EMPLOYEE", 
    "AIRPLANES", 
    "AIRPORTS", 
    "ROUTES", 
    "FLIGHTS", 
    "PASSENGERS", 
    "TICKETS"
]
schema = "IEPLANE"

for table in tables_to_check:
    # Fetch first 3 rows for each table to inspect structure
    query = f"SELECT * FROM {schema}.{table} LIMIT 3"
    try:
        print(f"--- {query} ---")
        df = pd.read_sql(query, engine)
        print(df)
    except Exception as e:
        print(f"Error querying {table}: {e}")
    print("\n")

--- SELECT * FROM IEPLANE.COUNTRIES LIMIT 3 ---
          name                                   capital  population continent
0  Afghanistan  Kabul                                          67546      Asia
1      Albania  Tirana                                         95095    Europe
2      Algeria  Algiers                                        23120    Africa


--- SELECT * FROM IEPLANE.DEPARTMENT LIMIT 3 ---
  deptno                       deptname      budget       location
0    A00  COMPUTER SERVICES DIVISION HQ   629633.18  WASHINGTON DC
1    A01            OPERATIONAL SYSTEMS  6326868.78  NEW YORK CITY
2    A02         DATA WAREHOUSE SYSTEMS  6052910.64  NEW YORK CITY


--- SELECT * FROM IEPLANE.EMPLOYEE LIMIT 3 ---
      empno  firstnme midinit lastname  is_external workdept  \
0  838N0183  Kendrick       R   Craven        False      G02
1  838N0001    Sawyer       E   Mosley        False      D02
2  838N0002    Sophie       I    Croft        False      D01

                    email phoneno    hiredate              job  is_parttime  \
0  kendri.craven@acme.com    4542  2016-01-02     RECEPTIONIST        False
1  sawyer.mosley@acme.com    6004  2016-10-10  SALESMAN JUNIOR        False
2   sophie.croft@acme.com    4168  2013-10-12  SALESMAN SENIOR         True

             edlevel gender   birthdate    salary    bonus     comm
0    Bachelor Degree      M  2012-02-21  21583.42      NaN      NaN
1    Bachelor Degree      M  1993-11-19  16217.76  1621.49  1913.96
2  Primary Education      F  1985-03-17  13474.14  1218.26  5077.90


--- SELECT * FROM IEPLANE.AIRPLANES LIMIT 3 ---
  aircraft_registration                     model  seats_business  \
0               IE00216  AIRBUS A320(320) Express              18
1               IE02067      BOEING B737 (800) V3              16
2               IE02258      AIRBUS A330-200(332)              19

   seats_premium  seats_economy  crew_members  build_date  fuel_gallons_hour  \
0            NaN            162             8  2000-01-04                291
1           42.0            108             8  2000-01-29                291
2            NaN            269            12  2000-02-04                386

  maintenance_last_acheck maintenance_last_bcheck  maintenance_takeoffs  \
0              2024-05-03              2024-03-08                   442
1              2024-03-06              2024-03-09                   790
2              2024-04-05              2024-03-15                   756

   maintenance_flight_hours  total_flight_distance
0                       805                 612677
1                       750                 198244
2                       826                 598002


--- SELECT * FROM IEPLANE.AIRPORTS LIMIT 3 ---
  iata_code                      airport      city        country continent  \
0       TPA  Tampa International Airport     Tampa  UNITED STATES   AMERICA
1       ATL   Hartsfield Jackson Atlanta   Atlanta  UNITED STATES   AMERICA
2       JFK      John Fitzgerald Kennedy  New York  UNITED STATES   AMERICA

  timezone   latitude  longitude  airport_tax
0    CUT-5  27.975500 -82.533203        10.84
1    CUT-5  33.636700 -84.428101        11.88
2    CUT-5  40.639801 -73.778900          NaN


--- SELECT * FROM IEPLANE.ROUTES LIMIT 3 ---
  route_code origin destination parent_route  leg_number  distance  \
0       R002    TPA         ATL       R001             1       655
1       R003    ATL         JFK       R001             2      1223
2       R006    ATL         JFK       R004             2      1223

   flight_minutes
0              66
1             107
2             107


--- SELECT * FROM IEPLANE.FLIGHTS LIMIT 3 ---
  flight_id  flight_leg frequency route_code           departure  \
0    IE0006           1        F1       R002 2000-01-03 10:20:00
1    IE0006           2        F1       R003 2000-01-03 12:26:00
2    IE0006           0        F1       R001 2000-01-03 07:05:00

              arrival airplane  price_economy  price_premium  price_business
0 2000-01-03 11:26:00  IE33216          97.13         128.74          159.87
1 2000-01-03 14:13:00  IE33216         164.01         240.45          293.55
2 2000-01-03 09:20:00  IE33216         229.82         300.74          333.37


--- SELECT * FROM IEPLANE.PASSENGERS LIMIT 3 ---
   id firstnme midinit lastname gender  birth_date   passport  country  \
0   1   Leland       N    Wicks      M  1967-05-17  332031941  GERMANY
1   2    Macie       E  Ballard      F  1982-04-16  337226804    ITALY
2   3   Joanna       N   Briggs      F  1964-12-24  927837523   ISRAEL

  vipcard      phone                  email
0    None  110425806  lelan.wicks@gmail.com
1    None  497857660                   None
2    None  881472718                   None


--- SELECT * FROM IEPLANE.TICKETS LIMIT 3 ---
      ticket_id  passenger_id flight_id route_code           departure class  \
0  T1234-027643         27336    IE0022       R012 2012-08-25 11:52:00     E
1  T1234-027644         27347    IE0022       R013 2012-08-25 20:30:00     P
2  T1234-027645         27358    IE0016       R037 2012-08-25 23:05:00     E

   seat    price  airport_tax  local_tax  total_amount
0  E6     445.96        11.01      93.65        550.62
1  A3    1011.41         0.04     212.39       1223.84
2  K9     935.65        18.71     196.48       1150.84